In [59]:
import pandas as pd
import numpy as np
import seaborn as sns

In [60]:
seri = pd.Series([4,5,6,7],index=["t","e","s","r"])
seri

t    4
e    5
s    6
r    7
dtype: int64

In [61]:
seri["e":"s"]

e    5
s    6
dtype: int64

In [62]:
sozluk = {"a":1,
          "b":2,
          "c":3}
sozluk

{'a': 1, 'b': 2, 'c': 3}

In [63]:
seri = pd.Series(sozluk)
seri

a    1
b    2
c    3
dtype: int64

In [64]:
a = np.arange(2,10)
seri = pd.Series(a,)
seri

0    2
1    3
2    4
3    5
4    6
5    7
6    8
7    9
dtype: int32

In [65]:
c = pd.concat([seri,seri])
c

0    2
1    3
2    4
3    5
4    6
5    7
6    8
7    9
0    2
1    3
2    4
3    5
4    6
5    7
6    8
7    9
dtype: int32

In [66]:
seri

0    2
1    3
2    4
3    5
4    6
5    7
6    8
7    9
dtype: int32

In [67]:
a = np.random.randint(1,10,3)
seri = pd.Series(a, index=["a","b","c"])
seri

a    3
b    9
c    6
dtype: int32

In [68]:
seri[[1]]

C:\Users\kariz\AppData\Local\Temp\ipykernel_3144\2026785939.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  seri[[1]]

b    9
dtype: int32

In [69]:
seri[1] = 15
seri

C:\Users\kariz\AppData\Local\Temp\ipykernel_3144\3491128774.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  seri[1] = 15

a     3
b    15
c     6
dtype: int32

In [70]:
seri["a"]

3

In [71]:
l = np.array([1,2,3,4,56,8,7])
name = ["onur"]
df = pd.DataFrame(l,columns=[name])
df

  onur
0    1
1    2
2    3
3    4
4   56
5    8
6    7

In [72]:
s1 = np.arange(10)
sozluk = {"a":s1}

In [73]:
fd = pd.DataFrame(sozluk,columns=["a"])
fd

   a
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

In [74]:
fd.index = [np.arange(20,40,2)]
fd

    a
20  0
22  1
24  2
26  3
28  4
30  5
32  6
34  7
36  8
38  9

In [75]:
df.drop(1,axis=0)

  onur
0    1
2    3
3    4
4   56
5    8
6    7

In [76]:
df.drop(1,axis=0,inplace=True)
df

  onur
0    1
2    3
3    4
4   56
5    8
6    7

In [77]:
b = np.arange(1,10).reshape(3,3)
df = pd.DataFrame(b,columns=["a1","a2","a3"])
df

   a1  a2  a3
0   1   2   3
1   4   5   6
2   7   8   9

In [78]:
df["a4"] = df["a1"] + df["a2"]
df

   a1  a2  a3  a4
0   1   2   3   3
1   4   5   6   9
2   7   8   9  15

In [79]:
a = np.random.randint(1,10,(10,3))
df = pd.DataFrame(a)
df

   0  1  2
0  4  8  4
1  1  2  6
2  2  5  2
3  1  2  3
4  2  9  8
5  3  3  9
6  9  4  6
7  8  4  1
8  8  5  7
9  7  3  2

In [80]:
df.columns=["a","b","c"]
df

   a  b  c
0  4  8  4
1  1  2  6
2  2  5  2
3  1  2  3
4  2  9  8
5  3  3  9
6  9  4  6
7  8  4  1
8  8  5  7
9  7  3  2

In [81]:
df[:2][["a","b"]]

   a  b
0  4  8
1  1  2

In [82]:
df[(df.a > 5) & (df.b < 3)]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [83]:
a = df

In [84]:
pd.concat([a,a],ignore_index=True)

    a  b  c
0   4  8  4
1   1  2  6
2   2  5  2
3   1  2  3
4   2  9  8
5   3  3  9
6   9  4  6
7   8  4  1
8   8  5  7
9   7  3  2
10  4  8  4
11  1  2  6
12  2  5  2
13  1  2  3
14  2  9  8
15  3  3  9
16  9  4  6
17  8  4  1
18  8  5  7
19  7  3  2

In [85]:
pd.concat([a,a])

   a  b  c
0  4  8  4
1  1  2  6
2  2  5  2
3  1  2  3
4  2  9  8
5  3  3  9
6  9  4  6
7  8  4  1
8  8  5  7
9  7  3  2
0  4  8  4
1  1  2  6
2  2  5  2
3  1  2  3
4  2  9  8
5  3  3  9
6  9  4  6
7  8  4  1
8  8  5  7
9  7  3  2

In [86]:
df0 = pd.DataFrame({"calisanlar" : ["ali","veli","ayse","fatma"],
                    "grup" : ["muhasebe","muhendislik","muhendislik","ik"]})
df4 = pd.DataFrame({"calisanlar" : ["ali","veli","ayse","fatma"],
                    "ilk_giris" : [2000,2009,2014,2019]})

In [87]:
df3 = pd.merge(df0,df4)
df3

  calisanlar         grup  ilk_giris
0        ali     muhasebe       2000
1       veli  muhendislik       2009
2       ayse  muhendislik       2014
3      fatma           ik       2019

In [88]:
df = sns.load_dataset("planets")
df.head(10)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009
5  Radial Velocity       1         185.840   4.80     76.39  2008
6  Radial Velocity       1        1773.400   4.64     18.15  2002
7  Radial Velocity       1         798.500    NaN     21.41  1996
8  Radial Velocity       1         993.300  10.30     73.10  2008
9  Radial Velocity       2         452.800   1.99     74.79  2010

In [89]:
df["number"].sum()

1848

In [90]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [91]:
a = np.arange(1,10).reshape(3,3)
df = pd.DataFrame(a, columns = ["a","b","c"])
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [92]:
df[["a","c"]]

   a  c
0  1  3
1  4  6
2  7  9